#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-prod-sso-requests/runs/run-ko8CVormgdj2Fq11

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
random_password.db_password: Refreshing state... [id=none]
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=7pXWFg]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-api-swagger]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=kgodz1zmk2]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.s3_sysdig.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-keycloak]
aws_dynamodb_table.state_locking: Refreshing state... [id=xgr00q-prod-state-locking]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:751704728437:certificate/842691e5-ab99-440d-8818-d4b9e623eec3]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
module.s3_ocp.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-ocp]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=smd25o]
aws_api_gateway_resource.actions: Refreshing state... [id=vw6kd8]
aws_api_gateway_resource.app: Refreshing state... [id=mzokxa]
aws_api_gateway_resource.api: Refreshing state... [id=l8vstw]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=fxl742]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api.loginproxy.gov.bc.ca]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=8c4eij]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cn65f5]
aws_api_gateway_resource.app_proxy: Refreshing state... [id=sh34oh]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-kgodz1zmk2-fxl742-GET]
aws_security_group.rds_sg: Refreshing state... [id=sg-0cbc5116a7eb44966]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=5k4vgg]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-kgodz1zmk2-8c4eij-GET]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-006d5ccf7acdb99cc]
module.s3_sysdig.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_sysdig.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-sysdig,private]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-api-swagger,private]
module.s3_sysdig.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_sysdig.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-keycloak]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-kgodz1zmk2-cn65f5-ANY]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-keycloak,private]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210903190658559400000001]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-kgodz1zmk2-5k4vgg-ANY]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-kgodz1zmk2-fxl742-GET-200]
aws_api_gateway_method.app_proxy: Refreshing state... [id=agm-kgodz1zmk2-sh34oh-ANY]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-kgodz1zmk2-fxl742-GET]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-kgodz1zmk2-8c4eij-GET]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-kgodz1zmk2-8c4eij-GET-200]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=g92x81]
module.s3_ocp.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-ocp,private]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
module.s3_ocp.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-ocp]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-kgodz1zmk2-fxl742-GET-200]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-kgodz1zmk2-8c4eij-GET-200]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-3019186098]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-kgodz1zmk2-cn65f5-ANY]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-kgodz1zmk2-5k4vgg-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.app: Refreshing state... [id=agi-kgodz1zmk2-sh34oh-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=t930rx]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_api_gateway_integration.app has been changed
  ~ resource "aws_api_gateway_integration" "app" {
      + cache_key_parameters    = []
        id                      = "agi-kgodz1zmk2-sh34oh-ANY"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }
  # aws_api_gateway_method.app_proxy has been changed
  ~ resource "aws_api_gateway_method" "app_proxy" {
      + authorization_scopes = []
        id                   = "agm-kgodz1zmk2-sh34oh-ANY"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-10-24T23:35:01.849Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.actions will be updated in-place
  ~ resource "aws_api_gateway_integration" "actions" {
      ~ cache_key_parameters    = [
          + "method.request.path.proxy",
        ]
        id                      = "agi-kgodz1zmk2-cn65f5-ANY"
      ~ request_parameters      = {
          + "integration.request.path.proxy" = "method.request.path.proxy"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.app will be updated in-place
  ~ resource "aws_api_gateway_integration" "app" {
      ~ cache_key_parameters    = [
          + "method.request.path.proxy",
        ]
        id                      = "agi-kgodz1zmk2-sh34oh-ANY"
      ~ request_parameters      = {
          + "integration.request.path.proxy" = "method.request.path.proxy"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_api_gateway_method.app_proxy will be updated in-place
  ~ resource "aws_api_gateway_method" "app_proxy" {
        id                   = "agm-kgodz1zmk2-sh34oh-ANY"
      ~ request_parameters   = {
          + "method.request.path.proxy" = true
        }
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-10-24T23:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "CPlVbIZxGW4RIhEzHtTqo25wptjFUW+SdHxkwpTbZr0=" -> "GsRTZyDlLxOH14OrUFa5ev7l4eA3zbNbfK2ac4ZUx8Y="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-10-24T23:34:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "sDnpE/+YnhZChUGRW0TWRuRzcGl00MJWSX7b3Q2z7Us=" -> "oUekOJGv0sP4k+nKczQKYOcTYZbuBm8+drAGIpDUuDw="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-10-24T23:35:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "/GTPvTI506tPf2IM2e5l4wFRnCkbm51WE9676qBGJ4g=" -> "MmuV5BnZk6AnLko//uBGHvXx3RSH2m+NwBXA3KQLuGQ="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-10-24T23:34:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "mA4jyPlWpOI+yv0TwKbLUoZnDEgsgG0m2nWqza5OUdQ=" -> "813gRn+exLEf8mMiPXkt1QFscOLfemc0TBXLPNnolPE="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-10-24T23:34:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "LYsixbHZBPGW2xVNOTSdbfxEN1mnypCKBPl8AixEbk4=" -> "mFUB3bS3g8Y0apWvrGz8ZtPN5xQz1HVc++CGsS39brg="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_s3_object.swagger_dist["swagger-output.json"] will be updated in-place
  ~ resource "aws_s3_object" "swagger_dist" {
      ~ etag               = "3034981810d9c4d076e3dbc7e3a4139c" -> "97f9098d17d7b448a8c4adf5b2ffa683"
        id                 = "swagger-output.json"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 9 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-10-24T23:35:01.849Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 40 estimated
           $172.8/mo +$0.0

```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*